       77 WRK-INVESTIMENTO PIC 9(09)V99 VALUE ZEROS.
       77 WRK-QNT PIC 9(02) VALUE ZEROS.
       77 WRK-TAXA PIC 9(08)V99 VALUE ZEROS.
       77 WRK-INICIAL-ED PIC $Z.ZZZ.ZZ9,99 VALUE ZEROS.
       77 WRK-INVESTIMENTO-ED PIC $Z.ZZZ.ZZ9,99 VALUE ZEROS.
       