       77 WRK-VENDAS PIC 9(06)V99 VALUE ZEROS.
       77 WRK-QNT PIC 9(03) VALUE ZEROS.
       77 WRK-ACUM PIC 9(08)V99 VALUE ZEROS.
       77 WRK-ACUM-ED PIC $ZZZ.ZZ9,99 VALUE ZEROS.
       